Revit 2027 API
WorksetTable.IsWorksetNameUnique Method
 Checks if the given workset name is unique in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsWorksetNameUnique(
	Document aDoc,
	string name
)
Public Shared Function IsWorksetNameUnique (
	aDoc As Document,
	name As String
) As Boolean
public:
static bool IsWorksetNameUnique(
	Document^ aDoc,
	String^ name
)
static member IsWorksetNameUnique :
        aDoc : Document *
        name : string -> bool
Parameters
aDoc Document
 The document in which the workset is accessed.
name String
 The workset name.
Return Value
Boolean
 True if this given workset name is unique in the document, false otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
WorksetTable Class
Autodesk.Revit.DB Namespace